#### Terraform Format 🖌 `success`
#### Terraform Init ⚙️ `success`
#### Terraform Validate 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.dynamodb_billing_enforcer[0].data.archive_file.enforcer_lambda: Reading...
module.dynamodb_billing_enforcer[0].data.archive_file.enforcer_lambda: Read complete after 0s [id=f376f1c2968b21f6d2558489c4bd7d1a58c683a3]
data.aws_organizations_organizational_unit_descendant_accounts.sandbox_pool[0]: Reading...
module.scp_manager.aws_organizations_policy.cost_avoidance_services[0]: Refreshing state... [id=p-64setrzn]
module.budgets[0].aws_sns_topic.budget_alerts[0]: Refreshing state... [id=arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts]
module.dynamodb_billing_enforcer[0].aws_iam_role.enforcer_lambda: Refreshing state... [id=ndx-dynamodb-billing-enforcer]
module.scp_manager.aws_organizations_policy.nuke_supported_services: Refreshing state... [id=p-7pd0szg9]
module.scp_manager.aws_organizations_policy.restrictions: Refreshing state... [id=p-6tw8eixp]
module.dynamodb_billing_enforcer[0].aws_cloudwatch_event_rule.dynamodb_table_changes: Refreshing state... [id=ndx-dynamodb-billing-enforcer]
module.budgets[0].aws_iam_role.budget_actions[0]: Refreshing state... [id=ndx-sandbox-budget-actions]
module.scp_manager.aws_organizations_policy.cost_avoidance_compute[0]: Refreshing state... [id=p-1rzl0ufv]
module.budgets[0].aws_sns_topic_policy.budget_alerts[0]: Refreshing state... [id=arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts]
module.scp_manager.aws_organizations_policy_attachment.restrictions: Refreshing state... [id=ou-2laj-4dyae1oa:p-6tw8eixp]
module.scp_manager.aws_organizations_policy_attachment.nuke_supported_services: Refreshing state... [id=ou-2laj-4dyae1oa:p-7pd0szg9]
module.scp_manager.aws_organizations_policy_attachment.cost_avoidance_services[0]: Refreshing state... [id=ou-2laj-sre4rnjs:p-64setrzn]
module.scp_manager.aws_organizations_policy_attachment.cost_avoidance_compute[0]: Refreshing state... [id=ou-2laj-sre4rnjs:p-1rzl0ufv]
module.budgets[0].aws_iam_role_policy.budget_actions[0]: Refreshing state... [id=ndx-sandbox-budget-actions:ndx-sandbox-budget-actions-policy]
module.dynamodb_billing_enforcer[0].aws_iam_role_policy.enforcer_lambda: Refreshing state... [id=ndx-dynamodb-billing-enforcer:ndx-dynamodb-billing-enforcer-policy]
module.dynamodb_billing_enforcer[0].aws_lambda_function.enforcer: Refreshing state... [id=ndx-dynamodb-billing-enforcer]
module.dynamodb_billing_enforcer[0].aws_lambda_permission.allow_eventbridge: Refreshing state... [id=AllowExecutionFromEventBridge]
module.dynamodb_billing_enforcer[0].aws_cloudwatch_event_target.invoke_enforcer_lambda: Refreshing state... [id=ndx-dynamodb-billing-enforcer-InvokeEnforcerLambda]
module.dynamodb_billing_enforcer[0].aws_cloudwatch_log_group.enforcer_lambda: Refreshing state... [id=/aws/lambda/ndx-dynamodb-billing-enforcer]
data.aws_organizations_organizational_unit_descendant_accounts.sandbox_pool[0]: Read complete after 4s [id=ou-2laj-4dyae1oa]
module.budgets[0].aws_budgets_budget.service["dynamodb"]: Refreshing state... [id=955063685555:ndx-sandbox-dynamodb-daily]
module.budgets[0].aws_budgets_budget.service["s3"]: Refreshing state... [id=955063685555:ndx-sandbox-s3-daily]
module.budgets[0].aws_budgets_budget.service["cloudwatch"]: Refreshing state... [id=955063685555:ndx-sandbox-cloudwatch-daily]
module.budgets[0].aws_budgets_budget.service["data_transfer"]: Refreshing state... [id=955063685555:ndx-sandbox-data-transfer-daily]
module.budgets[0].aws_budgets_budget.service["stepfunctions"]: Refreshing state... [id=955063685555:ndx-sandbox-stepfunctions-daily]
module.budgets[0].aws_budgets_budget.service["apigateway"]: Refreshing state... [id=955063685555:ndx-sandbox-apigateway-daily]
module.budgets[0].aws_budgets_budget.service["ec2"]: Refreshing state... [id=955063685555:ndx-sandbox-ec2-daily]
module.budgets[0].aws_budgets_budget.service["lambda"]: Refreshing state... [id=955063685555:ndx-sandbox-lambda-daily]
module.budgets[0].aws_budgets_budget.service["rds"]: Refreshing state... [id=955063685555:ndx-sandbox-rds-daily]
module.budgets[0].aws_budgets_budget.service["bedrock"]: Refreshing state... [id=955063685555:ndx-sandbox-bedrock-daily]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["612812183319"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-612812183319]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["755721375370"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-755721375370]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["860334207711"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-860334207711]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["922231562337"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-922231562337]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["848960887562"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-848960887562]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["351596827933"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-351596827933]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["779679300290"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-779679300290]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["519956516613"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-519956516613]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["376102585208"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-376102585208]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["984124409966"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-984124409966]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["244477277411"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-244477277411]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["841315966619"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-841315966619]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["463734035367"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-463734035367]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["219682480615"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-219682480615]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["631534400954"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-631534400954]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["954672827056"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-954672827056]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["417845783913"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-417845783913]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["905355901031"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-905355901031]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["031374266460"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-031374266460]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["603054822861"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-603054822861]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["044617623767"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-044617623767]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["145928771130"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-145928771130]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["680464296760"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-680464296760]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["474150620604"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-474150620604]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["766593778588"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-766593778588]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["498228254649"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-498228254649]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["608420805751"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-608420805751]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["888449443958"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-888449443958]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["817437954564"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-817437954564]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["324971197427"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-324971197427]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["545738259308"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-545738259308]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["507210367122"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-507210367122]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["040681451889"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-040681451889]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["995631985080"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-995631985080]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["318724430992"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-318724430992]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["635054837212"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-635054837212]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["311464492184"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-311464492184]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["320514709809"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-320514709809]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["967471469677"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-967471469677]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["655798857794"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-655798857794]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["389517403200"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-389517403200]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["594862215936"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-594862215936]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["070223343851"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-070223343851]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["388465176321"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-388465176321]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["455162986470"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-455162986470]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["916340099025"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-916340099025]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["467138365486"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-467138365486]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["023138541607"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-023138541607]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["203802643303"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-203802643303]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["636163194565"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-636163194565]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["429293900360"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-429293900360]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["247473515974"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-247473515974]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["394747152891"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-394747152891]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["821214029745"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-821214029745]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["836688626392"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-836688626392]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["931122829451"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-931122829451]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["508022879657"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-508022879657]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["097457367424"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-097457367424]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["196530534588"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-196530534588]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["260317865312"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-260317865312]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["359289023176"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-359289023176]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["944765969159"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-944765969159]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["942128689475"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-942128689475]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["831494785845"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-831494785845]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["088253294930"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-088253294930]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["703965236269"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-703965236269]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["126462206463"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-126462206463]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["221131122202"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-221131122202]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["666871912903"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-666871912903]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["383465662146"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-383465662146]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["116226089680"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-116226089680]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["003789736367"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-003789736367]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["652259507528"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-652259507528]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["609665072531"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-609665072531]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["511586394766"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-511586394766]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["745404749327"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-745404749327]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["942454901459"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-942454901459]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["766092484967"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-766092484967]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["147177189623"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-147177189623]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["107721656289"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-107721656289]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["631534400946"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-631534400946]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["539468396259"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-539468396259]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["221792773038"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-221792773038]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["108772197125"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-108772197125]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["449788867583"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-449788867583]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["002259668312"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-002259668312]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["355353495651"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-355353495651]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["982203978489"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-982203978489]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["003021232734"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-003021232734]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["342327770051"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-342327770051]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["336138913069"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-336138913069]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["041659741313"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-041659741313]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["316444450881"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-316444450881]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["340601547583"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-340601547583]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["965569989595"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-965569989595]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["599476213282"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-599476213282]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["169976489830"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-169976489830]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["450312424716"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-450312424716]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["570118540744"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-570118540744]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["477918843891"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-477918843891]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["504888427971"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-504888427971]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["981743521915"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-981743521915]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["158988875417"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-158988875417]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["331986576554"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-331986576554]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["987020212374"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-987020212374]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["946846710406"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-946846710406]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["404584456509"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-404584456509]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["074964562079"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-074964562079]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["352246554840"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-352246554840]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["097639379483"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-097639379483]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["053624041477"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-053624041477]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["664685894118"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-664685894118]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["966725470802"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-966725470802]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["631534400946"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-631534400946]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["631534400954"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-631534400954]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["311464492184"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-311464492184]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["196530534588"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-196530534588]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["203802643303"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-203802643303]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["766593778588"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-766593778588]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["860334207711"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-860334207711]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["260317865312"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-260317865312]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["219682480615"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-219682480615]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["982203978489"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-982203978489]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["352246554840"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-352246554840]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["388465176321"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-388465176321]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["539468396259"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-539468396259]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["097639379483"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-097639379483]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["504888427971"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-504888427971]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["636163194565"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-636163194565]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["031374266460"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-031374266460]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["967471469677"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-967471469677]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["003021232734"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-003021232734]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["666871912903"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-666871912903]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["053624041477"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-053624041477]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["965569989595"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-965569989595]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["351596827933"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-351596827933]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["044617623767"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-044617623767]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["023138541607"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-023138541607]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["888449443958"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-888449443958]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["817437954564"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-817437954564]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["417845783913"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-417845783913]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["320514709809"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-320514709809]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["703965236269"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-703965236269]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["107721656289"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-107721656289]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["942128689475"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-942128689475]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["147177189623"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-147177189623]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["097457367424"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-097457367424]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["946846710406"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-946846710406]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["404584456509"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-404584456509]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["169976489830"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-169976489830]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["766092484967"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-766092484967]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["158988875417"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-158988875417]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["145928771130"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-145928771130]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["508022879657"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-508022879657]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["498228254649"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-498228254649]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["450312424716"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-450312424716]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["966725470802"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-966725470802]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["545738259308"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-545738259308]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["074964562079"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-074964562079]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["981743521915"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-981743521915]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["507210367122"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-507210367122]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["984124409966"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-984124409966]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["449788867583"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-449788867583]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["040681451889"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-040681451889]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["831494785845"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-831494785845]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["664685894118"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-664685894118]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["570118540744"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-570118540744]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["383465662146"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-383465662146]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["609665072531"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-609665072531]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["944765969159"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-944765969159]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["599476213282"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-599476213282]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["655798857794"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-655798857794]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["340601547583"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-340601547583]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["126462206463"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-126462206463]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["467138365486"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-467138365486]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["954672827056"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-954672827056]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["594862215936"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-594862215936]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["474150620604"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-474150620604]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["942454901459"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-942454901459]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["318724430992"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-318724430992]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["244477277411"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-244477277411]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["922231562337"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-922231562337]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["916340099025"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-916340099025]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["848960887562"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-848960887562]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["070223343851"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-070223343851]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["088253294930"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-088253294930]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["221131122202"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-221131122202]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["841315966619"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-841315966619]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["429293900360"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-429293900360]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["389517403200"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-389517403200]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["745404749327"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-745404749327]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["905355901031"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-905355901031]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["463734035367"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-463734035367]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["342327770051"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-342327770051]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["612812183319"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-612812183319]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["519956516613"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-519956516613]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["108772197125"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-108772197125]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["455162986470"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-455162986470]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["002259668312"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-002259668312]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["603054822861"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-603054822861]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["511586394766"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-511586394766]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["376102585208"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-376102585208]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["331986576554"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-331986576554]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["316444450881"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-316444450881]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["779679300290"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-779679300290]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["995631985080"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-995631985080]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["359289023176"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-359289023176]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["336138913069"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-336138913069]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["221792773038"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-221792773038]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["755721375370"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-755721375370]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["931122829451"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-931122829451]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["116226089680"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-116226089680]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["394747152891"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-394747152891]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["680464296760"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-680464296760]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["324971197427"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-324971197427]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["355353495651"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-355353495651]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["836688626392"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-836688626392]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["652259507528"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-652259507528]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["003789736367"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-003789736367]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["635054837212"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-635054837212]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["247473515974"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-247473515974]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["821214029745"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-821214029745]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["041659741313"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-041659741313]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["987020212374"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-987020212374]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["477918843891"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-477918843891]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["608420805751"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-608420805751]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.budgets[0].aws_budgets_budget.daily_cost_per_account["110044886490"] will be created
  + resource "aws_budgets_budget" "daily_cost_per_account" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "50"
      + limit_unit        = "USD"
      + name              = "ndx-sandbox-daily-110044886490"
      + name_prefix       = (known after apply)
      + tags              = {
          + "Component"        = "Budget-Guardrails"
          + "SandboxAccountId" = "110044886490"
        }
      + tags_all          = {
          + "Component"        = "Budget-Guardrails"
          + "Environment"      = "production"
          + "ManagedBy"        = "Terraform"
          + "Project"          = "NDX"
          + "Repository"       = "terraform-scp-overrides"
          + "SandboxAccountId" = "110044886490"
        }
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = (known after apply)
      + time_unit         = "DAILY"

      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "110044886490",
            ]
        }

      + cost_types {
          + include_credit             = false
          + include_discount           = true
          + include_other_subscription = true
          + include_recurring          = true
          + include_refund             = false
          + include_subscription       = true
          + include_support            = true
          + include_tax                = true
          + include_upfront            = true
          + use_amortized              = false
          + use_blended                = false
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = [
              + "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ]
          + threshold                  = 100
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = [
              + "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ]
          + threshold                  = 10
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = [
              + "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ]
          + threshold                  = 50
          + threshold_type             = "PERCENTAGE"
        }
    }

  # module.budgets[0].aws_budgets_budget.daily_cost_per_account["110428899231"] will be created
  + resource "aws_budgets_budget" "daily_cost_per_account" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "50"
      + limit_unit        = "USD"
      + name              = "ndx-sandbox-daily-110428899231"
      + name_prefix       = (known after apply)
      + tags              = {
          + "Component"        = "Budget-Guardrails"
          + "SandboxAccountId" = "110428899231"
        }
      + tags_all          = {
          + "Component"        = "Budget-Guardrails"
          + "Environment"      = "production"
          + "ManagedBy"        = "Terraform"
          + "Project"          = "NDX"
          + "Repository"       = "terraform-scp-overrides"
          + "SandboxAccountId" = "110428899231"
        }
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = (known after apply)
      + time_unit         = "DAILY"

      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "110428899231",
            ]
        }

      + cost_types {
          + include_credit             = false
          + include_discount           = true
          + include_other_subscription = true
          + include_recurring          = true
          + include_refund             = false
          + include_subscription       = true
          + include_support            = true
          + include_tax                = true
          + include_upfront            = true
          + use_amortized              = false
          + use_blended                = false
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = [
              + "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ]
          + threshold                  = 100
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = [
              + "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ]
          + threshold                  = 10
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = [
              + "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ]
          + threshold                  = 50
          + threshold_type             = "PERCENTAGE"
        }
    }

  # module.budgets[0].aws_budgets_budget.daily_cost_per_account["182460208078"] will be created
  + resource "aws_budgets_budget" "daily_cost_per_account" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "50"
      + limit_unit        = "USD"
      + name              = "ndx-sandbox-daily-182460208078"
      + name_prefix       = (known after apply)
      + tags              = {
          + "Component"        = "Budget-Guardrails"
          + "SandboxAccountId" = "182460208078"
        }
      + tags_all          = {
          + "Component"        = "Budget-Guardrails"
          + "Environment"      = "production"
          + "ManagedBy"        = "Terraform"
          + "Project"          = "NDX"
          + "Repository"       = "terraform-scp-overrides"
          + "SandboxAccountId" = "182460208078"
        }
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = (known after apply)
      + time_unit         = "DAILY"

      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "182460208078",
            ]
        }

      + cost_types {
          + include_credit             = false
          + include_discount           = true
          + include_other_subscription = true
          + include_recurring          = true
          + include_refund             = false
          + include_subscription       = true
          + include_support            = true
          + include_tax                = true
          + include_upfront            = true
          + use_amortized              = false
          + use_blended                = false
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = [
              + "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ]
          + threshold                  = 100
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = [
              + "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ]
          + threshold                  = 10
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = [
              + "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ]
          + threshold                  = 50
          + threshold_type             = "PERCENTAGE"
        }
    }

  # module.budgets[0].aws_budgets_budget.daily_cost_per_account["190035265326"] will be created
  + resource "aws_budgets_budget" "daily_cost_per_account" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "50"
      + limit_unit        = "USD"
      + name              = "ndx-sandbox-daily-190035265326"
      + name_prefix       = (known after apply)
      + tags              = {
          + "Component"        = "Budget-Guardrails"
          + "SandboxAccountId" = "190035265326"
        }
      + tags_all          = {
          + "Component"        = "Budget-Guardrails"
          + "Environment"      = "production"
          + "ManagedBy"        = "Terraform"
          + "Project"          = "NDX"
          + "Repository"       = "terraform-scp-overrides"
          + "SandboxAccountId" = "190035265326"
        }
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = (known after apply)
      + time_unit         = "DAILY"

      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "190035265326",
            ]
        }

      + cost_types {
          + include_credit             = false
          + include_discount           = true
          + include_other_subscription = true
          + include_recurring          = true
          + include_refund             = false
          + include_subscription       = true
          + include_support            = true
          + include_tax                = true
          + include_upfront            = true
          + use_amortized              = false
          + use_blended                = false
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = [
              + "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ]
          + threshold                  = 100
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = [
              + "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ]
          + threshold                  = 10
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = [
              + "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ]
          + threshold                  = 50
          + threshold_type             = "PERCENTAGE"
        }
    }

  # module.budgets[0].aws_budgets_budget.daily_cost_per_account["252552941771"] will be created
  + resource "aws_budgets_budget" "daily_cost_per_account" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "50"
      + limit_unit        = "USD"
      + name              = "ndx-sandbox-daily-252552941771"
      + name_prefix       = (known after apply)
      + tags              = {
          + "Component"        = "Budget-Guardrails"
          + "SandboxAccountId" = "252552941771"
        }
      + tags_all          = {
          + "Component"        = "Budget-Guardrails"
          + "Environment"      = "production"
          + "ManagedBy"        = "Terraform"
          + "Project"          = "NDX"
          + "Repository"       = "terraform-scp-overrides"
          + "SandboxAccountId" = "252552941771"
        }
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = (known after apply)
      + time_unit         = "DAILY"

      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "252552941771",
            ]
        }

      + cost_types {
          + include_credit             = false
          + include_discount           = true
          + include_other_subscription = true
          + include_recurring          = true
          + include_refund             = false
          + include_subscription       = true
          + include_support            = true
          + include_tax                = true
          + include_upfront            = true
          + use_amortized              = false
          + use_blended                = false
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = [
              + "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ]
          + threshold                  = 100
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = [
              + "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ]
          + threshold                  = 10
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = [
              + "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ]
          + threshold                  = 50
          + threshold_type             = "PERCENTAGE"
        }
    }

  # module.budgets[0].aws_budgets_budget.daily_cost_per_account["261399255340"] will be created
  + resource "aws_budgets_budget" "daily_cost_per_account" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "50"
      + limit_unit        = "USD"
      + name              = "ndx-sandbox-daily-261399255340"
      + name_prefix       = (known after apply)
      + tags              = {
          + "Component"        = "Budget-Guardrails"
          + "SandboxAccountId" = "261399255340"
        }
      + tags_all          = {
          + "Component"        = "Budget-Guardrails"
          + "Environment"      = "production"
          + "ManagedBy"        = "Terraform"
          + "Project"          = "NDX"
          + "Repository"       = "terraform-scp-overrides"
          + "SandboxAccountId" = "261399255340"
        }
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = (known after apply)
      + time_unit         = "DAILY"

      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "261399255340",
            ]
        }

      + cost_types {
          + include_credit             = false
          + include_discount           = true
          + include_other_subscription = true
          + include_recurring          = true
          + include_refund             = false
          + include_subscription       = true
          + include_support            = true
          + include_tax                = true
          + include_upfront            = true
          + use_amortized              = false
          + use_blended                = false
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = [
              + "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ]
          + threshold                  = 100
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = [
              + "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ]
          + threshold                  = 10
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = [
              + "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ]
          + threshold                  = 50
          + threshold_type             = "PERCENTAGE"
        }
    }

  # module.budgets[0].aws_budgets_budget.daily_cost_per_account["304161164172"] will be created
  + resource "aws_budgets_budget" "daily_cost_per_account" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "50"
      + limit_unit        = "USD"
      + name              = "ndx-sandbox-daily-304161164172"
      + name_prefix       = (known after apply)
      + tags              = {
          + "Component"        = "Budget-Guardrails"
          + "SandboxAccountId" = "304161164172"
        }
      + tags_all          = {
          + "Component"        = "Budget-Guardrails"
          + "Environment"      = "production"
          + "ManagedBy"        = "Terraform"
          + "Project"          = "NDX"
          + "Repository"       = "terraform-scp-overrides"
          + "San

... (truncated, see workflow logs for full output)
```

</details>

*Pushed by: @chrisns, Action: `pull_request`*